<?xml version="1.0"?>
<net name="text-detection-0003" version="6" batch="1">
	<layers>
		<layer name="Placeholder" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_8714/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="model/conv2d/Conv2D" type="Convolution" precision="FP32" id="2">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="128" />
				<weights offset="152" size="3456" />
			</blobs>
		</layer>
		<layer name="model/re_lu/Relu6" type="Clamp" precision="FP32" id="3">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_1/Conv2D" type="Convolution" precision="FP32" id="4">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3608" size="128" />
				<weights offset="3736" size="4096" />
			</blobs>
		</layer>
		<layer name="model/re_lu_1/Relu6" type="Clamp" precision="FP32" id="5">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="6">
			<data auto_pad="same_upper" dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7832" size="1152" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d/separable_conv2d" type="Convolution" precision="FP32" id="7">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<biases offset="8984" size="128" />
				<weights offset="9112" size="4096" />
			</blobs>
		</layer>
		<layer name="model/re_lu_2/Relu6" type="Clamp" precision="FP32" id="8">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_2/Conv2D" type="Convolution" precision="FP32" id="9">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<biases offset="13208" size="64" />
				<weights offset="13272" size="2048" />
			</blobs>
		</layer>
		<layer name="model/conv2d_3/Conv2D" type="Convolution" precision="FP32" id="10">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<biases offset="15320" size="384" />
				<weights offset="15704" size="6144" />
			</blobs>
		</layer>
		<layer name="model/re_lu_3/Relu6" type="Clamp" precision="FP32" id="11">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_1/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="12">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="21848" size="3456" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_1/separable_conv2d" type="Convolution" precision="FP32" id="13">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<biases offset="25304" size="384" />
				<weights offset="25688" size="36864" />
			</blobs>
		</layer>
		<layer name="model/re_lu_4/Relu6" type="Clamp" precision="FP32" id="14">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_4/Conv2D" type="Convolution" precision="FP32" id="15">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<biases offset="62552" size="96" />
				<weights offset="62648" size="9216" />
			</blobs>
		</layer>
		<layer name="model/conv2d_5/Conv2D" type="Convolution" precision="FP32" id="16">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<biases offset="71864" size="576" />
				<weights offset="72440" size="13824" />
			</blobs>
		</layer>
		<layer name="model/re_lu_5/Relu6" type="Clamp" precision="FP32" id="17">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_2/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="18">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="86264" size="5184" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_2/separable_conv2d" type="Convolution" precision="FP32" id="19">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<biases offset="91448" size="576" />
				<weights offset="92024" size="82944" />
			</blobs>
		</layer>
		<layer name="model/re_lu_6/Relu6" type="Clamp" precision="FP32" id="20">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_6/Conv2D" type="Convolution" precision="FP32" id="21">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<biases offset="174968" size="96" />
				<weights offset="175064" size="13824" />
			</blobs>
		</layer>
		<layer name="model/add/add" type="Eltwise" precision="FP32" id="22">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_7/Conv2D" type="Convolution" precision="FP32" id="23">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<biases offset="188888" size="576" />
				<weights offset="189464" size="13824" />
			</blobs>
		</layer>
		<layer name="model/re_lu_7/Relu6" type="Clamp" precision="FP32" id="24">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_3/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="25">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="203288" size="5184" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_3/separable_conv2d" type="Convolution" precision="FP32" id="26">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="208472" size="576" />
				<weights offset="209048" size="82944" />
			</blobs>
		</layer>
		<layer name="model/re_lu_8/Relu6" type="Clamp" precision="FP32" id="27">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_8/Conv2D" type="Convolution" precision="FP32" id="28">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="291992" size="128" />
				<weights offset="292120" size="18432" />
			</blobs>
		</layer>
		<layer name="model/conv2d_9/Conv2D" type="Convolution" precision="FP32" id="29">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="310552" size="768" />
				<weights offset="311320" size="24576" />
			</blobs>
		</layer>
		<layer name="model/re_lu_9/Relu6" type="Clamp" precision="FP32" id="30">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_4/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="31">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="335896" size="6912" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_4/separable_conv2d" type="Convolution" precision="FP32" id="32">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="342808" size="768" />
				<weights offset="343576" size="147456" />
			</blobs>
		</layer>
		<layer name="model/re_lu_10/Relu6" type="Clamp" precision="FP32" id="33">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_10/Conv2D" type="Convolution" precision="FP32" id="34">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="491032" size="128" />
				<weights offset="491160" size="24576" />
			</blobs>
		</layer>
		<layer name="model/add_1/add" type="Eltwise" precision="FP32" id="35">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_11/Conv2D" type="Convolution" precision="FP32" id="36">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="515736" size="768" />
				<weights offset="516504" size="24576" />
			</blobs>
		</layer>
		<layer name="model/re_lu_11/Relu6" type="Clamp" precision="FP32" id="37">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_5/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="38">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="541080" size="6912" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_5/separable_conv2d" type="Convolution" precision="FP32" id="39">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="547992" size="768" />
				<weights offset="548760" size="147456" />
			</blobs>
		</layer>
		<layer name="model/re_lu_12/Relu6" type="Clamp" precision="FP32" id="40">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_12/Conv2D" type="Convolution" precision="FP32" id="41">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="696216" size="128" />
				<weights offset="696344" size="24576" />
			</blobs>
		</layer>
		<layer name="model/add_2/add" type="Eltwise" precision="FP32" id="42">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_13/Conv2D" type="Convolution" precision="FP32" id="43">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="720920" size="768" />
				<weights offset="721688" size="24576" />
			</blobs>
		</layer>
		<layer name="model/re_lu_13/Relu6" type="Clamp" precision="FP32" id="44">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_6/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="45">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="746264" size="6912" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_6/separable_conv2d" type="Convolution" precision="FP32" id="46">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="753176" size="768" />
				<weights offset="753944" size="147456" />
			</blobs>
		</layer>
		<layer name="model/re_lu_14/Relu6" type="Clamp" precision="FP32" id="47">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_14/Conv2D" type="Convolution" precision="FP32" id="48">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="901400" size="256" />
				<weights offset="901656" size="49152" />
			</blobs>
		</layer>
		<layer name="model/conv2d_15/Conv2D" type="Convolution" precision="FP32" id="49">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="950808" size="1536" />
				<weights offset="952344" size="98304" />
			</blobs>
		</layer>
		<layer name="model/re_lu_15/Relu6" type="Clamp" precision="FP32" id="50">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_7/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="51">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1050648" size="13824" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_7/separable_conv2d" type="Convolution" precision="FP32" id="52">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1064472" size="1536" />
				<weights offset="1066008" size="589824" />
			</blobs>
		</layer>
		<layer name="model/re_lu_16/Relu6" type="Clamp" precision="FP32" id="53">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_16/Conv2D" type="Convolution" precision="FP32" id="54">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1655832" size="256" />
				<weights offset="1656088" size="98304" />
			</blobs>
		</layer>
		<layer name="model/add_3/add" type="Eltwise" precision="FP32" id="55">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_17/Conv2D" type="Convolution" precision="FP32" id="56">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1754392" size="1536" />
				<weights offset="1755928" size="98304" />
			</blobs>
		</layer>
		<layer name="model/re_lu_17/Relu6" type="Clamp" precision="FP32" id="57">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_8/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="58">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1854232" size="13824" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_8/separable_conv2d" type="Convolution" precision="FP32" id="59">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1868056" size="1536" />
				<weights offset="1869592" size="589824" />
			</blobs>
		</layer>
		<layer name="model/re_lu_18/Relu6" type="Clamp" precision="FP32" id="60">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_18/Conv2D" type="Convolution" precision="FP32" id="61">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2459416" size="256" />
				<weights offset="2459672" size="98304" />
			</blobs>
		</layer>
		<layer name="model/add_4/add" type="Eltwise" precision="FP32" id="62">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_19/Conv2D" type="Convolution" precision="FP32" id="63">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2557976" size="1536" />
				<weights offset="2559512" size="98304" />
			</blobs>
		</layer>
		<layer name="model/re_lu_19/Relu6" type="Clamp" precision="FP32" id="64">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_9/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="65">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2657816" size="13824" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_9/separable_conv2d" type="Convolution" precision="FP32" id="66">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2671640" size="1536" />
				<weights offset="2673176" size="589824" />
			</blobs>
		</layer>
		<layer name="model/re_lu_20/Relu6" type="Clamp" precision="FP32" id="67">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_20/Conv2D" type="Convolution" precision="FP32" id="68">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3263000" size="256" />
				<weights offset="3263256" size="98304" />
			</blobs>
		</layer>
		<layer name="model/add_5/add" type="Eltwise" precision="FP32" id="69">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_42/Conv2D" type="Convolution" precision="FP32" id="70">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3361560" size="64" />
				<weights offset="3361624" size="4096" />
			</blobs>
		</layer>
		<layer name="model/conv2d_38/Conv2D" type="Convolution" precision="FP32" id="71">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3365720" size="8" />
				<weights offset="3365728" size="512" />
			</blobs>
		</layer>
		<layer name="model/conv2d_21/Conv2D" type="Convolution" precision="FP32" id="72">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3366240" size="1536" />
				<weights offset="3367776" size="98304" />
			</blobs>
		</layer>
		<layer name="model/re_lu_21/Relu6" type="Clamp" precision="FP32" id="73">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_10/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="74">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3466080" size="13824" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_10/separable_conv2d" type="Convolution" precision="FP32" id="75">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3479904" size="1536" />
				<weights offset="3481440" size="589824" />
			</blobs>
		</layer>
		<layer name="model/re_lu_22/Relu6" type="Clamp" precision="FP32" id="76">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_22/Conv2D" type="Convolution" precision="FP32" id="77">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4071264" size="384" />
				<weights offset="4071648" size="147456" />
			</blobs>
		</layer>
		<layer name="model/conv2d_23/Conv2D" type="Convolution" precision="FP32" id="78">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4219104" size="2304" />
				<weights offset="4221408" size="221184" />
			</blobs>
		</layer>
		<layer name="model/re_lu_23/Relu6" type="Clamp" precision="FP32" id="79">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_11/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="80">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4442592" size="20736" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_11/separable_conv2d" type="Convolution" precision="FP32" id="81">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4463328" size="2304" />
				<weights offset="4465632" size="1327104" />
			</blobs>
		</layer>
		<layer name="model/re_lu_24/Relu6" type="Clamp" precision="FP32" id="82">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_24/Conv2D" type="Convolution" precision="FP32" id="83">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<biases offset="5792736" size="384" />
				<weights offset="5793120" size="221184" />
			</blobs>
		</layer>
		<layer name="model/add_6/add" type="Eltwise" precision="FP32" id="84">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_25/Conv2D" type="Convolution" precision="FP32" id="85">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6014304" size="2304" />
				<weights offset="6016608" size="221184" />
			</blobs>
		</layer>
		<layer name="model/re_lu_25/Relu6" type="Clamp" precision="FP32" id="86">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer name="model/separable_conv2d_12/separable_conv2d/depthwise" type="Convolution" precision="FP32" id="87">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6237792" size="20736" />
			</blobs>
		</layer>
		<layer name="model/separable_conv2d_12/separable_conv2d" type="Convolution" precision="FP32" id="88">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6258528" size="2304" />
				<weights offset="6260832" size="1327104" />
			</blobs>
		</layer>
		<layer name="model/re_lu_26/Relu6" type="Clamp" precision="FP32" id="89">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_26/Conv2D" type="Convolution" precision="FP32" id="90">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7587936" size="384" />
				<weights offset="7588320" size="221184" />
			</blobs>
		</layer>
		<layer name="model/add_7/add" type="Eltwise" precision="FP32" id="91">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer name="model/conv2d_41/Conv2D" type="Convolution" precision="FP32" id="92">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7809504" size="64" />
				<weights offset="7809568" size="6144" />
			</blobs>
		</layer>
